In [1]:
import numpy as np
import pandas as pd

dict={
    "name":['sanket','vishwanath','Prajwal','putru'],
    "marks":[55,66,77,88],
    "city":['gulbarga','shahabad','wadi','solapur']  
}

In [5]:
df=pd.DataFrame(dict)

In [6]:
df

         name  marks      city
0      sanket     55  gulbarga
1  vishwanath     66  shahabad
2     Prajwal     77      wadi
3       putru     88   solapur

In [10]:
df.to_csv('patil.csv' ,index=False)

In [11]:
df.describe()

           marks
count   4.000000
mean   71.500000
std    14.200939
min    55.000000
25%    63.250000
50%    71.500000
75%    79.750000
max    88.000000

In [12]:
df.head()

         name  marks      city
0      sanket     55  gulbarga
1  vishwanath     66  shahabad
2     Prajwal     77      wadi
3       putru     88   solapur

In [13]:
df.tail()

         name  marks      city
0      sanket     55  gulbarga
1  vishwanath     66  shahabad
2     Prajwal     77      wadi
3       putru     88   solapur

In [14]:
harry=pd.read_csv('sanket.csv')

In [15]:
harry

   Train no  speed      city
0     12456     65  gulbarga
1     13264     66  shahabad
2     32165     77      wadi
3     64931     88   solapur

In [18]:
harry['speed'][0]=80

C:\Users\Sanket\AppData\Local\Temp\ipykernel_16780\1162722758.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['speed'][0]=80

In [19]:
harry

   Train no  speed      city
0     12456     80  gulbarga
1     13264     66  shahabad
2     32165     77      wadi
3     64931     88   solapur

In [20]:
harry.index=['sanket','patil','prajwal','siddu']

In [21]:
harry

         Train no  speed      city
sanket      12456     80  gulbarga
patil       13264     66  shahabad
prajwal     32165     77      wadi
siddu       64931     88   solapur